// Task.cpp : Определяет функции для статической библиотеки.
//

#include "pch.h"
#include "Task.h"

/*
	Разместите в данном файле функцию, которая проверяет корректность BMP файла, имя которого передается
	ей в качестве параметра


	1. Функция должна иметь имя CheckBMP
	2. Функция в качестве параметров должна принимать следующее:
		- первый параметр - Имя файла, строковый тип std::string
	3. Функция должна возвращать true, если переданный файл является файлом Windows bitmap
	и false в противном случае

	!!!!! ВАЖНО !!!!!
	В данном файле разрешается разместить кроме кода требуемой функции - код любых других вспомогательных
	функций. Никакой функции main() в этом файле быть не должно.
	Если вы хотите испытать и отладить вашу функцию - пишите код в файле Example.cpp проекта Example данного решения
	Для этого задайте в качестве запускаемого проекта проект Example.

	ДЛЯ АВТОМАТИЧЕСКОГО ТЕСТИРОВАНИЯ  проверки правильности работы вашего задания - сделайте запукаемым проект
	Tests и запустите его. Если функция написана правильно - все тесты должны успешно выполниться
	(зеленый цвет в консоли). Если ваша функция работает некорректно - в консоли будут сообщения красным цветом
*/
